const a002 = [["信札","拆封","谁","为难"],["不过","寥寥","数行"],["娟秀","字迹","温柔","却","感伤"],["你","将","心事","上了","淡妆"],["该说的","话","却","被","仔细","收藏"],["暮色","望","垂杨"],["拱桥","粼粼","月光"],["忆","往事","我","走笔","也","阑珊"],["红颜如霜","凝结了","过往"],["芦苇花","开","岁","已寒"],["若","霜","又降","路遥","漫长"],["墙外","是谁","在吟唱","凤求凰"],["梨园","台上","西皮二黄"],["却","少了","你","无人问暖"],["谁","在","彼岸","天涯一方"],["一句","甚安无念"],["你说","落笔","太难"],["窗外","古琴","幽兰"],["琴声","平添","孤单"],["我","墨","走了","几行"],["泪","潸然","落了款"],["思念","徒留","纸上"],["一整篇","被晕染"],["何故","远走","潇湘"],["你","却","语多委婉"],["走过","萧瑟","秋凉"],["等来","芒草","催黄"],["而","我","遥望","轻轻叹"],["捎来的","他乡"],["到底","隔","几条江"],["一封信","到底","转了","几道弯"],["缘分","飘落在","山外山"],["而","鱼雁","不在往返"]];

function join(a, a2){
  let a003 = a[0] + "<br>";
  for(let i=1; i<a.length; i++){
    a003 += a[i]+ "<br>";
  }
  return a003;
}

function multipleChoice(){
 const a001 = document.getElementById("content");
 a001.innerHTML = join(a002, a001);
}
